app/controllers/barbecues_controller.rb

SELECT "barbecues".* FROM "barbecues"  ORDER BY "barbecues"."date" ASC
---
  def index
    @barbecues = Barbecue.order(:date)

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = $1 LIMIT 1  [["id", 6]]
---
  def showApi
    @bbq = Barbecue.find(params[:id])

INSERT INTO "barbecues" ("title", "venue", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "BBQ RU"], ["venue", "Ironhack"], ["date", "2016-03-17 00:00:00.000000"], ["created_at", "2016-03-11 09:19:41.200360"], ["updated_at", "2016-03-11 09:19:41.200360"]]
---
  def create
    bbq_params = params.require(:barbecue).permit(:title, :venue, :date)
    @bbq = Barbecue.new(bbq_params)

    unless @bbq.save

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = $1 LIMIT 1  [["id", 11]]
---
  def join
    @bbq = Barbecue.find(params[:id])